backend/models/Software.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);
---
SELECT * FROM `software` WHERE `id`=2

    public static function findIdentities($ids)
    {
        return static::findAll($ids);
---
SELECT * FROM `software` WHERE 0=1