backend/models/Source.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);
---
SELECT * FROM `source` WHERE `id`='4'

    public static function getMainSofts()
    {
        return ArrayHelper::map(Software::find()->where(['soft_type' => 1])->all(), 'id', 'id');
---
SELECT * FROM `software` WHERE `soft_type`=1

    public static function getGameSofts()
    {
        return ArrayHelper::map(Software::find()->where(['soft_type' => 2])->all(), 'id', 'id');
---
SELECT * FROM `software` WHERE `soft_type`=2